<?php
return array(
    //'配置项'=>'配置值'
    'OPEN_REGISTER'    => 1, // 是否开启注册
    'TAGLIB_PRE_LOAD'  =>    'Cx,Html,Index\\TagLib\\Manage',
    //#官网错误代码 从8开始
    //学校申请开通
    'ERROR_80101'   =>  '学校名为2-25个汉字或字母',
    'ERROR_80102'   =>  '联系人为2-6个汉字',
    //用户教师身份认证
    'ERROR_80103'   =>  '教师资格证编号格式错误！',
    'ERROR_80104'   =>  '教师等级编号格式有误！',
    'ERROR_80105'   =>  '照片上传失败！<br>请确认教师资格证照片和等级证照片，且大小不能超过'.ini_get('upload_max_filesize'),
    'ERROR_80106'   =>  '教师认证信息保存失败！',
    'ERROR_80107'   =>  '教师身份已认证！',
    'ERROR_80108'   =>  '身份证号码格式错误！',//首页认证信息
    'ERROR_80109'   =>  '地址不正确！',//首页完善资料信息
    'ERROR_80110'   =>  '申请失败,请重试！',
    'ERROR_80111'   =>  '开通方式为空！',
    'ERROR_80112'   =>  '会员暂时开放购买,敬请期待!',//支付宝购买权限
    'ERROR_80113'   =>  '您提交的信息已存在,请勿重复提交！',
    'ERROR_80114'   =>  '没有要删除的数据！',
    'ERROR_80115'   =>  '标签名称重复请更换！',

);
?>