<?php
return array(
    //'配置项'=>'配置值'
    'OPEN_REGISTER'              =>    1, // 是否开启注册
    'ERROR_1X401'                =>    '没有解析！',
    'ERROR_1X402'                =>    '请输入正确的地址!',
    'ERROR_1X403'                =>    '原密码错误',
    'ERROR_1X404'                =>    '暂时没有收藏试题',
    'ERROR_1X405'                =>    '数据状态有误',
    'ERROR_1X406'                =>    '请重试！',
    'ERROR_1X407'                =>    '目录不存在！',
    'ERROR_1X408'                =>    '目录id获取失败！',
    'ERROR_1X409'                =>    '请填写目录名称！',
    'ERROR_1X410'                =>    '修改目录名称失败！',
    'ERROR_1X411'                =>    '删除目录失败！',
    'ERROR_1X412'                =>    '删除试题失败！',
    'ERROR_1X413'                =>    '身份证号码格式错误！',//首页认证信息
    'ERROR_1X414'   =>  '教师资格证编号格式错误！',
    'ERROR_1X415'   =>  '教师等级编号格式有误！',
    'ERROR_1X416'   =>  '照片上传失败！<br>请确认教师资格证照片和等级证照片，且大小不能超过'.ini_get('upload_max_filesize'),
    'ERROR_1X417'   =>  '教师认证信息保存失败！',
    'ERROR_1X418'   =>  '地址不正确！',//首页完善资料信息
    'ERROR_1X419'   =>  '会员暂时开放购买,敬请期待!',//支付宝购买权限
    'ERROR_1X420'   =>  '教师身份已认证！',
    'ERROR_1X421'   =>  '没有相关试题！',
    'ERROR_1X422'   =>  '请填写邮箱！',
    'ERROR_1X423'   =>  '订单异常,请确认您的订单编号,如有疑问,请联系客服!',
    'ERROR_1X424'   =>  '数据状态有误，删除数据失败！',
    'ERROR_1X425'   =>  '请重新登录',
    'ERROR_1X426'   =>  '请填写正确的邮箱！',
    'ERROR_1X427'   =>  '数据库发生异常,请重试,如给您带来不便,敬请原谅!',
    'ERROR_1X428'   =>  '删除收藏失败',
    'ERROR_1X429'   =>  '历史存档不存在！',
    'ERROR_1X430'   =>  '插入数据失败！',
    'ERROR_1X431'   =>  '分组名重复请更换！',
    'ERROR_1X432'   =>  '更改包月失败！',
    'ERROR_1X433'   =>  '日期格式有误！',
    'ERROR_1X434'   =>  '修改权限组失败！',
    'ERROR_1X435'   =>  '生成数据中断，数据重复严重请检查！',
    'ERROR_1X436'   =>  '请填写数字！',
    'ERROR_1X437'   =>  '您要删除的数据中存在已使用或者没有权限操作的邀请码！',
    'ERROR_1X438'   =>  '生成学号失败！',
    'ERROR_1X439'   =>  '更改点数失败！',
    'ERROR_1X440'   =>  '当前用户不是教师！',
    'ERROR_1X441'   =>  '用户序号有误！',
    'ERROR_1X442'   =>  '无效数据！',
    'ERROR_1X443'   =>  '评论失败！',
    'ERROR_1X444'   =>  '提交的内容不能为空！',

);
?>