<?php
return array(
    //'配置项'=>'配置值'
    'WLN_USER_AUTH_KEY'       =>     'zj_teacher_name',     //admin session name
    'WLN_WEB_NAME'             =>    '编辑系统',             //admin session name
    'TAGLIB_PRE_LOAD'     =>     'html' ,             //import tags
    'TEST_KEY'              =>     '#EDFV&^UJ#*&YH$H*&' , //doc转换服务器验证码
    'WLN_COOKIE_TIMEOUT'       =>  72000 ,//cookie超时时间单位秒

    //Public
    'ERROR_40001'   =>  '用户名请使用邮箱或手机号！',
    'ERROR_40002'   =>  '账户、密码的长度不应小于6！',
    'ERROR_40003'   =>  '您的账户未审核，请联系管理员审核账户！',
    'ERROR_40004'   =>  '该账号数据异常，操作失败！',
    'ERROR_40005'   =>  '请输入新密码！!',
    
    //教师端错误代码 从4开始
    'ERROR_40101'   =>  '选择试题不能为空',
    'ERROR_40102'   =>  '添加失败！请添加word文档。',
    'ERROR_40103'   =>  '您下载的文档名为【%s[xxxx年xx月xx日]】，请核对文档名是否正确！',
    'ERROR_40104'   =>  '文档名称重复！',
    'ERROR_40105'   =>  '您不能操作【%s】文档！',
    'ERROR_40106'   =>  '文档【%s】已提交！',
    'ERROR_40107'   =>  '删除失败！',
    'ERROR_40108'   =>  '文档标签规则为空，请联系相关人员进行处理！',
    'ERROR_40109'   =>  '文档%s被锁定，您无法提取试题！',
    'ERROR_40110'   =>  '请选择入库题目！',
    'ERROR_40111'   =>  '请确认上传文件是否正确！',
    'ERROR_40112'   =>  '任务不存在！',
    'ERROR_40113'   =>  '您没有操作该任务的权限！',
    'ERROR_40114'   =>  '该任务下没有试卷！',
    'ERROR_40115'   =>  '任务状态有误，您不能修改文档！',
    'ERROR_40116'   =>  '存在未提交的试卷，请编辑后再提交！',
    'ERROR_40117'   =>  '提交失败！',
    'ERROR_40118'   =>  '文档不存在！',
    'ERROR_40119'   =>  '不合法的操作！',
    'ERROR_40120'   =>  '提交试题失败！',
    'ERROR_40121'   =>  '提交任务失败！',
    'ERROR_40122'   =>  '你存在未完成任务，不能领取！',
    'ERROR_40123'   =>  '领取失败！',
    'ERROR_40124'   =>  '任务已过期',
    'ERROR_40125'   =>  '下载失败，请联系您的学科编辑以解决问题！',
    'ERROR_40126'   =>  '该试卷已经审核完毕，不能再更改相关数据！',
    //Check
    'ERROR_40201'   =>  '审核任务不存在！',
    'ERROR_40202'   =>  '审核文档任务不存在！',
    'ERROR_40203'   =>  '试题已经入库或不存在！',
    'ERROR_40204'   =>  '请检查试题是否已经全部审核！',
    //StudentWork
    'ERROR_40401'   =>  '存在未提交(状态：未完成)的试题！',
    'ERROR_40402'   =>  '编号:%s的记录已完成或正在重做，不能被删除！',
    'ERROR_40403'   =>  '编号:%s的记录因无权限未能被删除！',
    'ERROR_40404'   =>  '不合法的操作',
    'ERROR_40405'   =>  '该任务已经分配！',
    'ERROR_40406'   =>  '该任务未完成！',
    'ERROR_40407'   =>  '该任务已完成！',
    'ERROR_40408'   =>  '任务不存在！',
    'ERROR_40409'   =>  '该任务不包含文档，无法被审核！',
    'ERROR_40410'   =>  '提交任务失败，存在未审核的试题！',
    'ERROR_40411'   =>  '提交任务失败！',

    //Task
    'ERROR_40501'   =>  '您没有提交该文档的权限！',
    'ERROR_40502'   =>  '任务数据不存在！',
    'ERROR_40503'   =>  '存在不完善的试卷，请编辑后再提交！',
    'ERROR_40504'   =>  '试题已经入库或不存在！',
    'ERROR_40505'   =>  '该试卷下试题难度未标注完成！',
    'ERROR_40506'   =>  '文档未标引，没有数据！',
    'ERROR_40507'   =>  '没有文档信息！',
    'ERROR_40508'   =>  '该任务已经分配！',
    'ERROR_40509'   =>  '标引分配文档不能为空！',
    'ERROR_40510'   =>  '您没有权限删除该任务！',
    'ERROR_40511'   =>  '任务状态不允许删除！',
    'ERROR_40512'   =>  '任务已分配无法删除！',
    'ERROR_40513'   =>  '您没有权限审核该任务！',
    'ERROR_40514'   =>  '该任务下没有试卷！',
    'ERROR_40515'   =>  '该任务当前不是审核状态！',
    'ERROR_40516'   =>  '该任务下有未审核的试卷！',
    'ERROR_40517'   =>  '审核失败！',
    'ERROR_40518'   =>  '任务当前状态不需要审核！',
    'ERROR_40518'   =>  '任务当前状态不需要审核！',
    'ERROR_40519'   =>  '审核状态有误！',        
    'ERROR_40520'   =>  '修改状态失败！',
    'ERROR_40521'   =>  '任务已分配,请审核！',
    'ERROR_40522'   =>  '请选择审核教师！',




    //Test
    'ERROR_40601'   =>  '该试卷不存在可编辑的试题！',
    'ERROR_40602'   =>  '所选的知识点暂无提示信息！',
    'ERROR_40604'   =>  '文档已存在!',
    'ERROR_40605'   =>  '所有试题已经编辑完成！下面进入试题列表。',

    //TestCheck
    'ERROR_40701'   =>  '试题数据不存在或已入库！',
    'ERROR_40702'   =>  '试题与本次任务无关！',
    'ERROR_40703'   =>  '该试卷下面没有试题',
    'ERROR_40704'   =>  '添加审核数据失败！',
    //DocManager
    'ERROR_40801'   =>  '请为复合题增加小题测试类型！',
    'ERROR_40802'   =>  '文件不存在！',

    //CustomCheck
    'ERROR_40901'   =>  '请选择是否通过',
    'ERROR_40903'   =>  '重置试题失败，请重试',
    'ERROR_40904'   =>  '库内试题拷贝出错！请重试。',
    'ERROR_40905'   =>  '提交试题数据写入出错!请重试。',
    'ERROR_40906'   =>  '优化任务领取表不存在该试题！',
);
?>