<?php
return array(
    //'配置项'=>'配置值'
    'TAGLIB_PRE_LOAD'    =>    'Cx,Html,Index\\TagLib\\Manage',




    'ERROR_1X1001'   =>  '审核失败!',
    'ERROR_1X1002'   =>  '数据状态有误!',
    'ERROR_1X1003'   =>  '用户权限有误，删除数据失败!',
    'ERROR_1X1004'   =>  '提取失败！请查看提取日志!',
    'ERROR_1X1005'   =>  '所属年级不能为空!',
    'ERROR_1X1006'   =>  '该文档已经生成解析任务!',
    'ERROR_1X1007'   =>  '请选择入库题目！',
    'ERROR_1X1008'   =>  '您没有权限审核别人的文档！',
    'ERROR_1X1009'   =>  '数据已入库请先移出入库数据！',
    'ERROR_1X1010'   =>  '错误信息：本章节下已经存在对应能力的文档；重复添加!',
    'ERROR_1X1011'   =>  '添加失败！请添加word文档。!',
    'ERROR_1X1012'   =>  '请选择能力属性!',
    'ERROR_1X1013'   =>  '文档已被下载，不能修改！',
    'ERROR_1X1014'   =>  '用户已经下载过试卷，您不能修改！',
    'ERROR_1X1015'   =>  '指定给管理员失败！',
    'ERROR_1X1016'   =>  '听力内容上传失败！',
    'ERROR_1X1017'   =>  '该试卷不存在听力内容！',
    'ERROR_1X1018'   =>  '指定的文档不存在！',
    'ERROR_1X1019'   =>  '该订单已经使用不能再进行操作！',
    'ERROR_1X1020'   =>  '锁定的文档不能分配解析任务！',

);
?>