<?php
return array(
    //'配置项'=>'配置值'
    'TAGLIB_PRE_LOAD'    =>    'Cx,Html,Index\\TagLib\\Manage',

    'ERROR_1X2001'   =>  '所选试题部分已经不在试题库中！',
    'ERROR_1X2002'   =>  '复制试题到临时库',
    'ERROR_1X2003'   =>  '上传文档为空！',
    'ERROR_1X2004'   =>  '规则分值不能重复！',
    'ERROR_1X2005'   =>  '打分规则不能为空！',
    'ERROR_1X2006'   =>  '数据标示不对称！请通知管理员核实',
    'ERROR_1X2007'   =>  '您没有权限审核别人的试题！',
    'ERROR_1X2008'   =>  '入库操作失败！请检查试题状态！',
    'ERROR_1X2009'   =>  '试题属性不完整！请确认。试题编号【%s】',
    'ERROR_1X2010'   =>  '请为复合题增加小题测试类型！',
    'ERROR_1X2011'   =>  '数据信息不相符：%s',
    'ERROR_1X2012'   =>  '自定义去重失败',
    'ERROR_1X2013'   =>  '请选择重复试题!',
    'ERROR_1X2014'   =>  '缺失条件参数或获取默认章节不存在!',
    'ERROR_1X2015'   =>  '复合题需包含小题!',
    'ERROR_1X2016'   =>  '您当前为学生账号，暂无法浏览此页面',
    'ERROR_1X2017'   =>  '您没有登录！',
    'ERROR_1X2018'   =>  '该试题信息不存在！',

);
?>