<?php
return array(
    'DEFAULT_CONTROLLER'=>'Default',//默认的控制器名称
    'WLN_AAT_OPEN_REGISTER' => 1, // 0不开放 1开放
    'TAGLIB_PRE_LOAD' => 'html',
    'WLN_OPTIONS' => [
        '1' => 'A',
        '2' => 'B',
        '3' => 'C',
        '4' => 'D',
        '5' => 'E',
        '6' => 'F',
        '7' => 'G',
        '8' => 'H',
        '9' => 'I',
        '10' => 'J',
        '11' => 'K',
        '12' => 'L'
    ],
    'WLN_TYPE_FILTER' => [
        '14' => '124',
    ],//学科ID为键，值为该学科要过滤的题型ID，逗号分隔
    'APP_KEY'               => 'fjieo89regfjfKDfsd9023rfkdfsdDds',//用于APP开发中生成token使用

    'ERROR_50001' => '全部内容必须填写！',
    'ERROR_50002' => 'VersionCode必须是数字！',
    'ERROR_50003' => '更新VersionCode结束值必须小于VersionCode',
    'ERROR_50004' => '版本Code不能重复！',
    'ERROR_50005' => '测试次数大于0不能修改！',
    'ERROR_50006' => '专题试卷名称不能为空！',
    'ERROR_50007' => '试卷类型不能为空！',
    'ERROR_50008' => '所属专题不能为空！',
    'ERROR_50009' => '文档编号不能为非数字',
    'ERROR_50010' => '文档编号不能为0',
    'ERROR_50011' => '试题编号不能为空',
    'ERROR_50013' => '专题名称不能为空！',
    'ERROR_50014' => '专题分类不能为空',
    'ERROR_50015' => '专题下有试卷不能删除',
    'ERROR_50016' => '您不能搜索非所属学科测试记录',
    'ERROR_50017' => '您不能编辑非所属学科测试记录',

    'ERROR_50018' => '获取学科数据失败！',
    'ERROR_50019' => '请先选择课本！',
    'ERROR_50020' => '教材获取失败，请重试！',
    'ERROR_50021' => '获取数据错误，请重试！',
    'ERROR_50022' => '数据提交错误请重新操作',

    'ERROR_50200' => '请求数据错误，请重试！',
    'ERROR_50201' => '同步学习版需选择教材，请进入个人中心来选择教材！',
    'ERROR_50202' => '获取试卷类型和知识点数据失败，请重试！',
    'ERROR_50203' => '暂无数据！',
    'ERROR_50204' => '暂无，请先进行更多测试以生成该图表！',
);