<?php
return array(
    'ERROR_1X5001' => '该试题暂时不能删除',
    'ERROR_1X5002' => '获取图片地址超时！',
    'ERROR_1X5003' => '上传验证失败或者过期，请重新扫描二维码！',
    'ERROR_1X5004' => '您不能对正在审核中的文档进行操作！',
    'ERROR_1X5005' => '您不能对正在审核中的文档进行操作！',
    'ERROR_1X5006' => '该文档的试题暂未提取！',
    'ERROR_1X5007' => '服务器连接失败，请重试！',
    'ERROR_1X5008' => '投稿失败，刷新页面重试！',
    'ERROR_1X5009' => '该试题已经投稿该原创题模版！',
    'ERROR_1X5010' => '上传失败，请重试！',
    'ERROR_1X5011' => '图片格式错误，请重试！',
    'ERROR_1X5012' => '您没有权限操作该任务！',
    'ERROR_1X5013' => '协同命制没有期次信息！',
    'ERROR_1X5014' => '模板信息不存在！',
    'ERROR_1X5015' => '该模板中没有试题！',
    'ERROR_1X5016' => '无法参与，该原创命制已经过期！',
);